<script lang="ts" setup>
import "./advantages.scss";

import Anvantage from "./advantage.vue"


const anvantages = [
    {
        title: 'Систематизация', 
        text: "Моя сверхзадача в жизни — систематизировать всё вокруг. Люблю анализировать процессы и взаимосвязи, искать и решать проблемы, избавляться от нелогичности. Из этого вытекает моя безграничная неприязнь к созданию вида бурной трудовой деятельности."
    },
    {
        title: 'Инициативность', 
        text: "Я всегда стараюсь занимать преактивную позицию во всех процессах, которые могут быть полезны команде и продукту. Не боюсь освещать проблемы, которые вижу, и всегда делаю это прямолинейно."
    },
    {
        title: 'Вечное обучение', 
        text: "Я на постоянной основе изучаю курсы, видео, статьи и книги. При этом в мою выборку попадают материалы не только по дизайну, но и смежным сферам: разработке, управление проектами, маркетинг, юнит-экономика, геймификация и т.д."
    },
    {
        title: 'Дизайн = Frontend', 
        text: "Дизайн в отрыве от разработки - просто картинки. Поэтому я считаю, что отдел дизайна и frontend’a должны быть одним целым. Имею обширный опыт в вёрстке, в дизайне руководствуюсь BEM-методологией, в слоях закладываю базовую структуру."
    },

]


</script>


<template>

    <section id="advantages" class="advantages">
        <div class="advantages__heading">
            <h2>Сильные стороны</h2>
        </div>
        <ul class="advantages__list">
            <Anvantage v-for="(anvantage, index) in anvantages">
                <template v-slot:title>{{ anvantage.title }}</template>
                <template v-slot:body>
                    {{ anvantage.text }}
                </template>
            </Anvantage>
        </ul>

    </section>

</template>